{
    "economy": {
        "teethdesc": "You can use teeth to buy items or upgrades for me! Get teeth with daily commands, from crates, or by voting for me on {0} using {1}vote"
    },

    "err": {
        "noperm": "You are not allowed to perform that command... Required permission: `{0}` ",
        "botnoperm": "I am not allowed to perform that command ;-; Required permission: `{0}`",
        "invalidid": "Invalid id: '{0}'",
        "usage": "Incorrect usage! Run {0}help {1} for more information."
    },

    "helptxt": {
        "desc": "\nNeed help? Here is a list of all the things I can do. For more details on a specific command or category, type {1}help <name>"
    },

    "profile": {
        "title": ":hibiscus: {0}'s profile :hibiscus:"
    },

    "hug": {
        "none": "{0} needs a hug!",
        "self": "Hugging yourself, {0}?",
        "user": "{0} gave {1} a hug!",
        "me": "Hehe, thanks for the hug, {0}",
        "err": "I could not find that user, but I'll give you a hug instead <3"
    },
    
    "kiss": {
        "none": "{0} wants kisses :(",
        "self": "Kissing yourself, {0}?",
        "user": "{0} just kissed {1}!! How cuteee",
        "me": "D-did you just... ",
        "err": "Sorry {0}, I could not find that user in the server, s-so... umm, i'll give you one..."
    },

    "blush": {
        "none": "{0} is blushing!",
        "self": "{0} is blushing!",
        "user": "Awww, {1} made {0} blush...",
        "me": "Did I make you blush, {0}?",
        "err": "Sorry {0}, I could not find that person in the server, but I'm sure they're blushworthy <3"
    },

    "cuddle": {
        "none": "{0} wants cuddles ;-;",
        "self": "{0} is... cuddling themselves?",
        "user": "{0} is cuddling {1} <3",
        "me": "Y-you're cuddling me, {0}?",
        "err": "Sorry {0}, I could not find that person in the server, but I'll give you some cuddles :>"
    },

    "slap": {
        "none": "{0} is slapping... everyone? Themselves?",
        "self": "{0} is slapping themselves?",
        "user": "{0} slapped {1} :o",
        "me": "Owww.. it hurts, {0} :(",
        "err": "Sorry {0}, I could not find that person in the server, but you c-can hit me if you want..."
    },

    "isTaken": "Nice try, {0} is taken :wink:",
    
    "brief": {
        "autodelete": "Automatically deletes non-image messages in a given channel.",
        "clear": "Purge desired amount of messages.",
        "help": "Displays a list of all commands, and how to use them.",
        "say": "Make me say anything hehe",
        "embed": "I can embed messages for you and make them fancy!",
        "hug": "Give a hug to somebody who needs it <3",
        "kiss": "Kiss someone you fancy~",
        "cuddle": "Because who doesn't like cuddles?",
        "blush": "Something made you blush? Show it with a gif.",
        "slap": "Mad at somebody? Go ahead, release your anger."
    },

    "help": {
        "autodelete": "Set me to automatically delete all non-image messages in a given channel. This includes all captioned images and image links as well. Useful for maintaining pure image galleries, no bullshit.\nUsage: `{0}autodelete <command> <channel_id>`\nParameters: `start` `stop`\nExample: {0}autodelete start 693748784034625012",
        "clear": "Automatically delete a given amount of messages in the channel. Limit: 999 messages\nUsage: {0}clear <messages>\nExample: {0}clear 15",
        "help": "{0}help will display a list of all commands. {0}help <category> will display a list of all commands in a category, and {0}help <command> will display detailed information and usage about a specific command.",
        "say": "I can pass on a message for you, if you want. If possible, I will delete your command after sending. Example:\n`{0}say haha you're so funny`",
        "embed": "Have me embed and format a message. If possible, I will delete your command after sending. You can pass colour and title arguments to the command if you want, with the flags `-c` and `-t`. Titles must be closed in brackets, and colours must be hex values. Example:\n`{0}embed -c #000000 -t [announcement] actually nvm have a nice day guys`",
        "hug": "Makes me send a hug gif to the chat with a caption. Mentioning someone will change the caption.\nUsage: {0}hug @someone",
        "kiss": "Makes me send a kiss gif to the chat with a caption. Mentioning someone will change the caption.\nUsage: {0}kiss @someone",
        "cuddle": "Makes me send a cuddle gif to the chat with a caption. Mentioning someone will change the caption.\nUsage: {0}cuddle @someone",
        "blush": "Makes me send a blush gif to the chat with a caption. Mentioning someone will change the caption.\nUsage: {0}blush @someone",
        "slap": "Makes me send a slap gif to the chat with a caption. Mentioning someone will change the caption.\nUsage: {0}slap @someone"
    }
}
